"""
Суммы числе от 1 до N

Итерация - однократное выполнение тела цикла
"""

N = 1000
s = 0
i = 1
while i <= N:
    s = s + i
    i = i + 1
print(s)

"""Вывести все числа от 1 до 20, кратные 3:"""

N2 = 20
i = 1
while i <= N2:
    if i % 3 == 0:
        print(i)
    i += 1
